---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SpacingRule
source: html/d9b4a020-e872-0f1e-e5fc-2f1a44dc0ce3.htm
---
# SpacingRule Members

Causes the object to release immediately any resources it may be utilizing.